Repository: Chris53897/cidlookup
Catalog: i18n/*/LC_MESSAGES/cidlookup.po
Languages: de_de, fr_fr, hu_hu, pt_br

source: It executes an HTTP GET passing the caller number as argument to retrieve the correct name
de_de: Führt ein HTTP-GET mit der Nummer des Anrufers als Argument aus, um den korrekten Namen zu ermitteln
pt_br: Executa um HTTP GET passando o número do usuário chamador como argumento para encontrar o nome correto

source: It executes an HTTPS GET passing the caller number as argument to retrieve the correct name
de_de: Führt ein HTTPS-GET mit der Nummer des Anrufers als Argument aus, um den korrekten Namen zu ermitteln
pt_br: Executa um HTTPS GET passando o número do usuário chamador como argumento para encontrar o nome correto

source: Use DNS to lookup caller names, it uses ENUM lookup zones as configured in enum.conf
de_de: Verwende DNS, um Anrufernamen nachzuschauen, es verwendet ENUM-Nachschlagezonen wie in enum.conf konfiguriert
pt_br: Usa o DNS para pesquisar nomes de usuários chamadores, e utiliza a pesquisa de zonas ENUM conforme configurado em enum.conf

source: Use OpenCNAM [https://www.opencnam.com/]
de_de: OpenCNAM [https://www.opencnam.com/] verwenden
pt_br: Usa o OpenCNAM [https://www.opencnam.com/]

source: use astdb as lookup source, use phonebook module to populate it
de_de: verwende astdb als Nachschlagequelle, verwende Telefonbuchmodule, um sie zu bestücken
pt_br: usa o astdb como fonte de pesquisa, use o módulo da lista telefônica para preenchê-lo

source: <p>If you need to create an OpenCNAM account, you can visit their website: <a href="https://www.opencnam.com/register" target="_blank">https://www.opencnam.com/register</a></p>
de_de: <p>Wenn Sie ein OpenCNAM-Konto benötigen, können Sie diesen auf der Webseite <a href="https://www.opencnam.com/register" target="_blank">https://www.opencnam.com/register</a> anlegen.</p>
pt_br: <p>Se você necessita criar uma conta OpenCNAM, você pode visitar o site:<a href="https://www.opencnam.com/register" target="_blank">https://www.opencnam.com/register</a></p>

source: A Lookup Source let you specify a source for resolving numeric CallerIDs of incoming calls, you can then link an Inbound route to a specific CID source. This way you will have more detailed CDR reports with information taken directly from your CRM. You can also install the phonebook module to have a small number <-> name association. Pay attention, name lookup may slow down your PBX
de_de: Mit einer Nachschlagequelle können Sie eine Quelle für die Auflösung numerischer Anrufer-IDs eingehender Anrufe angeben. Anschließend können Sie eine eingehende Route mit einer bestimmten CID-Quelle verknüpfen. Auf diese Weise erhalten Sie detailliertere CDR-Berichte mit Informationen, die direkt aus Ihrem CRM stammen. Sie können das Telefonbuchmodul auch so installieren, dass eine kleine Nummer <-> Namenszuordnung besteht. Achten Sie darauf, dass die Namenssuche Ihre Telefonanlage verlangsamen kann
pt_br: Uma fonte de pesquisa permite que você especifique uma fonte para identificar número do usuário chamador nas chamadas de entrada, você pode vincular uma rota de entrada para uma fonte CID específica. Desta forma, você terá relatórios CDR mais detalhados com informações tiradas diretamente de seu CRM. Você também pode instalar o módulo de lista telefônica para ter uma pequena associação de número <-> nome. Preste atenção, a pesquisa de nomes pode prejudicar a performance do seu PBX

source: Account SID:
de_de: Konten-SID:
pt_br: Conta SID:

source: Actions
de_de: Aktionen
pt_br: Ações

source: Add CIDLookup Source
de_de: Füge CID-Nachschlagquelle hinzu
pt_br: Acrescentar Fonte de Pesquisa CID

source: Admin
de_de: Administrator
pt_br: Administrador

source: Allows CallerID Lookup of incoming calls against different sources (OpenCNAM, MySQL, HTTP, ENUM, Phonebook Module)
de_de: Erlaubt das Nachschlagen der Anrufer-ID (CallerID) bei verschiedenen Quellen (OpenCNAM,MySQL,HTTP,ENUM,Telefonbuch-Modul)
pt_br: Permite a pesquisa de ID de chamadas recebidas de diferentes fontes (OpenCNAM, MySQL, HTTP, ENUM, Módulo de lista telefônica)

source: Auth Token
de_de: Authentifizierungs-Token
pt_br: Chave de Autorização

source: CID Lookup Source
de_de: CID-Nachschlagequelle
fr_fr: Source de Consultation de CID
hu_hu: CID meghatározó forrás
pt_br: Fonte de Pesquisa CID

source: CIDLookup
de_de: CID nachschlagen
pt_br: Pesquisa CID

source: Cache Results
de_de: Ergebnisse zwischenspeichern
pt_br: Resultados de Cache

source: Caller ID Format
de_de: Format der Anrufer-ID

source: CallerID Lookup
de_de: AnruferID nachschlagen
pt_br: Pesquisa de ID Chamador

source: CallerID Lookup Sources
de_de: AnruferID Nachschlagquelle
fr_fr: Sources Consult. ID Appelant
pt_br: Fonte de Pesquisa CID

source: Character Set
de_de: Zeichensatz
pt_br: Conjunto de Caracteres

source: Company
de_de: Firma

source: Contact Manager
de_de: Kontaktverwaltung

source: Contact Manager Group(s)
de_de: Kontaktverwaltungsgruppe(n)

source: Contact Manager Not Installed
de_de: Kontaktverwaltung nicht installiert

source: Contact Manager:
de_de: Kontaktverwaltung:

source: Database
de_de: Datenbank
pt_br: Banco de Dados

source: Database Name
de_de: Datenbankname
pt_br: Nome do Banco de Dados

source: Decide whether or not cache the results to astDB; it will overwrite present values. It does not affect Internal source behavior
de_de: Entscheide, ob die Ergebnisse in die astDB zwischengespeichert werden oder nicht; das wird die aktuellen Werte überschreiben. Es beeinflusst nicht das Verhalten der internen Quellen
fr_fr: Décide de mettre en cache ou non les résultats dans astDB; cela écrasera les valeurs actuelles. N'affectera pas le comportement de source Interne
hu_hu: Legyen, vagy ne legyen a lekérdezés cachelve a belső astDB-ben; ez különbözhet az mindenkori értéktől. Nincs a belső adatbázisra értelmezve.
pt_br: Decida se os resultados serão ou não armazenados em cache no astDB; Ele substituirá os valores presentes. Não afeta o comportamento da fonte interna

source: Delete
de_de: Löschen
pt_br: Apagar

source: Description
de_de: Beschreibung
pt_br: Descrição

source: Display Name
de_de: Anzeigename

source: Enter a description for this source.
de_de: Geben Sie eine Beschreibung für diese Quelle ein.
fr_fr: Entrez une description pour cette source.
hu_hu: Adj meg egy nevet ehhez a forráshoz.
pt_br: Insira uma descrição para esta fonte.

source: Filter results to these contact manager groups
de_de: Filter die Ergebnisse nach diesen Kontaktverwaltungsgruppen

source: First Last
de_de: Erster Letzter

source: Host name or IP address
de_de: Hostname oder IP-Adresse
fr_fr: Nom de l'hôte ou adresse IP
hu_hu: Gépnév vagy IP-cím
pt_br: Nome do host ou endereço IP

source: How to format the returned data
de_de: Wie die zurückgegebenen Daten formatiert werden

source: Internal
de_de: Intern
pt_br: Interno

source: Internal:
de_de: Intern:
pt_br: Interno:

source: It queries a MySQL database to retrieve caller name
de_de: Fragt eine MySQL-Datenbank ab, um den Namen des Anrufers zu ermitteln
pt_br: Consulta um banco de dados MySQL para recuperar o nome do usuário chamador

source: Last First
de_de: Letztes zuerst

source: List Sources
de_de: Quellen auflisten
pt_br: Lista de Fontes

source: MySQL Character Set. Leave blank for MySQL default latin1
de_de: MySQL-Zeichensatz. Wird nichts eingegeben, wird der Standardzeichensatz Latin1 verwendet
pt_br: Conjunto de Caracteres MySQL . Deixar em branco para MySQL padrão latin1

source: MySQL Host
de_de: MySQL-Server
fr_fr: Hôte MySQL
hu_hu: MySQL gép
pt_br: Host MySQL

source: MySQL Password
de_de: MySQL-Passwort
fr_fr: Mot de Passe MySQL
hu_hu: MySQL jelszó
pt_br: Senha MySQL

source: MySQL Username
de_de: MySQL-Benutzername
fr_fr: Nom d'utilisateur MySQL
hu_hu: MySQL felhasználónév
pt_br: Nome de Usuário MySQL

source: No
de_de: Nein
pt_br: Não

source: None
de_de: Kein*e
fr_fr: Aucun
hu_hu: Nincs
pt_br: Nenhum

source: Not yet implemented
de_de: Noch nicht implementiert
fr_fr: Pas encore implémenté
pt_br: Ainda não implementado

source: OpenCNAM Requires Authentication
de_de: OpenCNAM erfordert eine Authentifizierung
pt_br: OpenCNAM Requer Autenticação

source: OpenCNAM Throttle Reached!
de_de: OpenCNAM-Drosselung erreicht!
pt_br: Acelerador OpenCNAM Alcançado!

source: Password
de_de: Passwort
pt_br: Senha

source: Password to use in HTTP authentication
de_de: Passwort, das in der HTTP-Authentifizierung verwendet werden soll
fr_fr: Mot de Passe à utiliser lors de l'authentification HTTP
hu_hu: Jelszó a HTTP azonosításhoz
pt_br: Senha para usar na autenticação HTTP

source: Path
de_de: Pfad
pt_br: Caminho

source: Path of the file to GET<br/>e.g.: /cidlookup.php<br>Special token '[NUMBER]' will be replaced with caller number<br/>e.g.: /cidlookup/[NUMBER]/<br/>'[NAME]' will be replaced with existing caller id name<br/>'[LANGUAGE]' will be replaced with channel language
de_de: Pfad der Datei, die abgerufen werden soll <br/> zB: /cidlookup.php <br> Sonderzeichen '[NUMBER]' wird durch die Anrufernummer ersetzt <br/> zB: / cidlookup / [NUMBER] / <br/> ' [NAME] 'wird durch den vorhandenen Anrufernamen ersetzt <br/>' [SPRACHE] 'wird durch die Kanalsprache ersetzt
pt_br: Caminho do arquivo para GET <br/> por exemplo: /cidlookup.php <br> O campol '[NUMBER]' será substituído pelo número do usuário chamador <br/> por exemplo: /cidlookup /[NUMBER]/<br/>'[NAME]' será substituído pelo nome existente do ID chamador <br/>'[LANGUAGE]' será substituído pelo idioma do canal

source: Port HTTP(s) server is listening at (default http 80, https 443)
de_de: Port des HTTP(S)-Servers (standardmäßig 80 für HTTP, 443 für HTTPS)
pt_br: Porta servidor HTTP(s) está ouvindo em (padrão http 80, https 443)

source: Query
de_de: Abfrage
pt_br: Consulta

source: Query string, special token '[NUMBER]' will be replaced with caller number<br/>e.g.: number=[NUMBER]&source=crm<br/>'[NAME]' will be replaced with existing caller id name<br/>'[LANGUAGE]' will be replaced with channel language<br/>'[UNIQUEID]' will be replaced with unique Asterisk callID
de_de: Abfragezeichenfolge, spezielles Token '[NUMBER]' wird durch Anrufernummer ersetzt<br/>z.B.: number=[NUMBER]&source=crm<br/>'[NAME]' wird durch vorhandenen Anrufer-ID-Namen ersetzt<br/>'[LANGUAGE]' wird durch Kanalsprache ersetzt<br/>'[UNIQUEID]' wird durch eindeutige Asterisk callID ersetzt

source: Query, special token '[NUMBER]' will be replaced with caller number<br/>e.g.: SELECT name FROM phonebook WHERE number LIKE '%[NUMBER]%'
de_de: Abfrage, spezielles Token "[NUMMER]" wird durch die Rufnummer des Anrufers ersetzt <br/> z. B .: SELECT name FROM phonebook WHERE number LIKE '%[NUMBER]%'
fr_fr: Requête, le signe spécial '[NUMBER]' sera remplacé par le numéro de l'appelant<br/>exemple : SELECT nom FROM annuaire WHERE numéro LIKE '%[NUMBER]%'
hu_hu: Lekérő string, ahol a '[NUMBER] jelöli a hívó számát.<br/>Pl.: SELECT name FROM phonebook WHERE number LIKE '%[NUMBER]%'
pt_br: Em uma query de consulta, o campo '[NUMBER]' será substituído pelo número do usuário chamador <br/> por exemplo: SELECT name FROM phonebook WHERE number LIKE '%[NUMBER]%'

source: Reset
de_de: Zurücksetzen
pt_br: Reiniciar

source: Searches a contact manager group
de_de: Durchsucht eine Kontaktmanager-Gruppe

source: Select the source type, you can choose between:
de_de: Wählen sie die Art der Quelle aus, die folgenden stehen zur Auswahl:
pt_br: Selecione o tipo de fonte, você pode escolher entre:

source: Source
de_de: Quelle
hu_hu: Forrás
pt_br: Fonte

source: Source Description
de_de: Beschreibung der Quelle
pt_br: Descrição da Fonte

source: Source type
de_de: Art der Quelle
pt_br: Tipo da Fonte

source: Sources can be added in Caller Name Lookup Sources section
de_de: Quellen können im Abschnitt Anrufernamen-Suchquellen hinzugefügt werden
fr_fr: Les sources peuvent être ajoutées dans la section Sources de Consultation du Nom de l'Appelant
hu_hu: Hozzáad egy forrást a CID meghatározó forrás részhez
pt_br: Fontes podem ser adicionadas na seção Fontes de Pesquisa de Nomes de Usuários Chamadores

source: Submit
de_de: Absenden
pt_br: Enviar

source: There are %s DIDs using this source that will no longer have lookups if deleted.
de_de: Es gibt %s DIDs, die diese Quelle verwenden und die beim Löschen keine Suche mehr ausführen.
pt_br: Há %s DIDs usando esta fonte que não poderão mais ser pesquisados caso seja excluída.

source: Type
de_de: Typ
pt_br: Tipo

source: Unauthenticated calls to the OpenCNAM API will soon fail. You will need an OpenCNAM account to continue using their API
de_de: Unauthentifizierte Abfragen von OpenCNAM werden in Kürze fehlschlagen. Sie werden ein OpenCNAM-Konto benötigen, um die API weiter zu nutzen
pt_br: As chamadas não autenticadas para a API OpenCNAM falharão em breve. Você precisará de uma conta OpenCNAM para continuar usando sua API

source: Username
de_de: Benutzername
pt_br: Nome de usuário

source: Username to use in HTTP authentication
de_de: Benutzername, der für die HTTP-Authentifizierung verwendet werden soll
fr_fr: Nom d'utlisateur à utiliser lors de l'authentification HTTP
hu_hu: Felhasználónév a HTTP azonosításhoz
pt_br: Nome de usuário para utilizar na autenticação HTTP

source: Yes
de_de: Ja
pt_br: Sim

source: You have gone past the free OpenCNAM usage limits.<br/><br/>To continue getting caller ID name information, you need to create an OpenCNAM Professional Account.<br/><br/>You can create an OpenCNAM account at: <a href="https://www.opencnam.com/register">https://www.opencnam.com/register</a>.<br/><br/>Once you have created an account, visit the CallerID Lookup Sources menu and enter your OpenCNAM Professional Tier credentials.<br/>
de_de: Sie haben das Limit für die kostenlose Nutzung von OpenCNAM überschritten.<br /><br />Um weiterhin Namensinformationen zu Anrufer-IDs (CallerIDs) zu erhalten, müssen Sie ein OpenCNAM-Professional-Konto anlegen.<br /><br /> Unter <a href="https://www.opencnam.com/register">https://www.opnecnam.com/register</a> können Sie ein OpenCNAM-Konto anlegen.<br /><br />Sobald Sie das Konto angelegt haben, geben Sie die Zugangsdaten für OpenCNAM Professional im Menü für die Anrufer-ID-Nachschlagequellen an.<br />
pt_br: Você ultrapassou os limites de utilização livre do OpenCNAM. <br/> <br/> Para continuar recebendo as informações do nome do ID Chamador, você precisa criar uma conta OpenCNAM Professional. <br/> <br/> Você pode criar uma conta OpenCNAM no : <a href="https://www.opencnam.com/register"> https://www.opencnam.com/register </a>. <br/> <br/> Depois de criar uma conta, Visite o menu Fontes de Pesquisa de ID Chamador e insira suas credenciais do nível profissional do OpenCNAM. <br/>

source: Your OpenCNAM Account SID. This can be found on your OpenCNAM dashboard page: https://www.opencnam.com/dashboard
de_de: Die SID Ihres OpenCNAM-Kontos. Sie finden sie auf Ihrer OpenCNAM-Übersichtsseite: https://www.opencnam.com/dashboard
pt_br: Seu SID da conta OpenCNAM. Isso pode ser encontrado no painel da página do OpenCNAM: https://www.opencnam.com/dashboard

source: Your OpenCNAM Auth Token. This can be found on your OpenCNAM dashboard page: https://www.opencnam.com/dashboard
de_de: Ihr OpenCNAM-Authentifizierungstoken. Sie finden es auf Ihrer OpenCNAM-Übersichtsseite: https://www.opencnam.com/dashboard
pt_br: Seu Token de Autorização OpenCNAM. Isso pode ser encontrado no painel da página do OpenCNAM: https://www.opencnam.com/dashboard

source: Checking for cidlookup field in core's incoming table..
fr_fr: Contôle du champ cidlookup dans la table entrants du coeur...
pt_br: Verificando o campo cidlookup na tabela de entrada do núcleo...

source: ERROR: failed:
fr_fr: ERREUR : échoué :
pt_br: ERRO: falhou:

source: FATAL: failed to transform old routes:
fr_fr: FATAL : n'a pas réussi à transformer les anciennes routes :
pt_br: FATAL: Falhou em transformar rotas antigas:

source: Migrating channel routing to Zap DID routing..
fr_fr: Migration du routage de canal vers le routage Zap DID...
pt_br: Migrando o roteamento de canal para o roteamento Zap DID...

source: Not Needed
fr_fr: Pas Nécessaire
pt_br: Não é Necessário

source: Port
pt_br: Porta

source: Processing Database Tables
pt_br: Processando Tabelas do Banco de Dados

source: Query string, special token '[NUMBER]' will be replaced with caller number<br/>e.g.: number=[NUMBER]&source=crm<br/>'[NAME]' will be replaced with existing caller id name<br/>'[LANGUAGE]' will be replaced with channel language
pt_br: Seqüência de consulta, o campo '[NUMBER]' será substituído pelo número do chamador <br/> por exemplo: número=[NUMBER]&source=crm<br/>'[NAME]' será substituído pelo nome do usuário chamador existente <br/> '[LANGUAGE]' será substituído pelo idioma do canal

source: Removing deprecated channel field from incoming..
fr_fr: Suppression du champ canal obsolète de entrants...
pt_br: Removendo campo de canal obsoleto de entrada...

source: not present
fr_fr: pas présent
pt_br: não presente

source: removed
fr_fr: éliminé
pt_br: removido

source: Add CID Lookup Source
fr_fr: Ajouter une Source de Consultation CID
hu_hu: CID-forrás hozzáadása

source: CID Lookup source
fr_fr: Source de Consultation CID
hu_hu: CID meghatározó forrás

source: deleted
fr_fr: supprimé
hu_hu: törölt

source: Delete CID Lookup source
fr_fr: Supprimer une Source de Consultation CID
hu_hu: CID meghatározó forrás törlése

source: Add Source
fr_fr: Ajouter une Source
hu_hu: Forrás hozzáadása

source: A Lookup Source let you specify a source for resolving numeric caller IDs of incoming calls, you can then link an Inbound route to a specific CID source. This way you will have more detailed CDR reports with informations taken directly from your CRM. You can also install the phonebook module to have a small number <-> name association. Pay attention, name lookup may slow down your PBX
fr_fr: Une Source de Consultation vous permet de spécifier une source pour résoudre les IDs numériques des appelants parmi les appels entrants. Vous pouvez ensuite lier une route entrante a une source CID spécifique. De cette façon vous aurez des rapports CDR plus détaillés avec des informations prises directement de votre CRM. Vous pouvez également installer le module d'annuaire pour avoir une association numéro court <-> nom. Attention, la consultation de nom peu ralentir votre PBX
hu_hu: A CID meghatározó forrás használatakor a hívó szám alapján a forrásban meghatározott név kiválasztásra kerül. Ehhez mindössze a bejövő hívásnál ki kell jelölnöd egy CID forrást. Ezen az úton átmenő hívások részletesebb, értelmezhetőbb CDR jelentést produkálnak, aminek nagy hasznát tudod venni például egy CDM-ben. A Telefonkönyv modullal egy kis szám <-> név kapcsolatot tudsz kialakítani. Hátránya, hogy a névfeloldás lassabbá teheti a PBX rendszert.

source: Edit Source
fr_fr: Editer la Source
hu_hu: Forrás szerkesztése

source: Source Description:
fr_fr: Description de la Source :
hu_hu: Forrás neve:

source: Source type:
fr_fr: Type de Source :
hu_hu: Forrás típusa:

source: Select the source type, you can choose between:<ul><li>Internal: use astdb as lookup source, use phonebook module to populate it</li><li>ENUM: Use DNS to lookup caller names, it uses ENUM lookup zones as configured in enum.conf</li><li>HTTP: It executes an HTTP GET passing the caller number as argument to retrieve the correct name</li><li>MySQL: It queries a MySQL database to retrieve caller name</li></ul>
fr_fr: Sélectionnez le type de source. Vous pouvez choisir entre : <ul><li>Interne : utiliser astdb comme source de consultation, utiliser le module d'annuaire pour la peupler</li><li>ENUM : Utiliser le DNS pour consulter les noms des appelants. Utilise les zones de consultation ENUM tel que configurées dans la configuration enum.</li><li>HTTP : Exécute un HTTP GET en passant le numéro de l'appelant comme argument pour récupérer le nom exact</li><li>MySQL : Requiert une Base de Données MySQL pour récupérer le nom de l'appelant</li></ul>
hu_hu: Add meg a forrás típusát az alábbiak alapján:<ul><li>Belső: az astdb-t használja forrásként. Használdd a Telefonkönyv modult a feltöltéséhez.</li><li>ENUM: DNS lekérdezést használ a hívó nevének meghatározásához. Az ENUM zónák meghatározásához az enum.conf-ot kell használnod.</li><li>HTTP: A GET parancs lesz használva, amelynek a visszatérési értékének kell a hívó pontos nevének lennie.</li><li>MySQL: A lekérdezés eredményének a hívó pontos nevének kell lennie.</li></ul>

source: Cache results:
fr_fr: Résulats du Cache :
hu_hu: Cache használata:

source: Host:
fr_fr: Hôte :
hu_hu: Cím:

source: Port HTTP server is listening at (default 80)
fr_fr: Le port HTTP du serveur est en écoute sur (80 par défaut)
hu_hu: Az a port, amin a HTTP szerver figyel (általában 80)

source: Username:
fr_fr: Nom d'utilisateur :
hu_hu: Felhasználónév:

source: Password:
fr_fr: Mot de Passe :
hu_hu: Jelszó:

source: Path:
fr_fr: Chemin :
hu_hu: Útvonal:

source: Path of the file to GET<br/>e.g.: /cidlookup.php
fr_fr: Chemin du fichier à OBTENIR<br/>exemple : /cidlookup.php
hu_hu: A fájlnév a GET-hez<br/> Pl.: /cidlookup.php

source: Query:
fr_fr: Requête :
hu_hu: Lekérdezés:

source: Query string, special token '[NUMBER]' will be replaced with caller number<br/>e.g.: number=[NUMBER]&source=crm
fr_fr: Chaîne de Requête, le signe spécial '[NUMBER]' sera remplacé par le numéro de l'appelant<br/>exemple : numéro=[NUMBER]&source=crm
hu_hu: Lekérő string, ahol a '[NUMBER] jelöli a hívó számát.<br/>Pl.: number=[NUMBER]&source=crm

source: Database:
fr_fr: Base de Données :
hu_hu: Adatbázis:

source: Database name
fr_fr: Nom de la Base de Données
hu_hu: Adatbázis neve

source: Submit Changes
fr_fr: Appliquer les Modifications

source: Caller ID Lookup
fr_fr: Consultation de l'ID de l'appelant

source: Source:
hu_hu: Forrás:
